# PanelScheduleView Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView Class
Members See Also
---
An instance of a panel schedule view.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PanelScheduleView : TableView
```

Visual Basic
---
```text
Public Class PanelScheduleView _
	Inherits TableView
```

Visual C++
---
```text
public ref class PanelScheduleView : public TableView
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..View Autodesk.Revit.DB..::..TableView Autodesk.Revit.DB.Electrical..::..PanelScheduleView
# See Also
PanelScheduleView Members
Autodesk.Revit.DB.Electrical Namespace